	
#Область ПрограммныйИнтерфейс	
	
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка);	
	
КонецФункции

Функция ОтправитьСообщение(ТекстСообщения, Токен, Отказ) Экспорт
	
	Возврат АссистентИнтеграцияСOpenAI.ОтправитьСообщение(ТекстСообщения, Токен, Отказ);
	
КонецФункции

Функция Токен() Экспорт
	
	Возврат АссистентИнтеграцияСOpenAIПовтИсп.Токен();
	
КонецФункции

#КонецОбласти
